Repository: gshank/data-muform
Catalog: lib/Data/MuForm/Messages/*.po
Languages: it

source: error occurred
it: C'è un errore

source: Value must be between {low} and {high}
it: Il valore deve essere compreso tra {low} e {high}

source: '{field_label}' field is required
it: Il campo '{field_label}' è obbligatorio

source: Value must be less than or equal to {high}
it: Il valore deve essere minore o eguale a {high}

source: Value must be greater than or equal to {low}
it: Il valore deve essere maggiore o eguale a {low}

source: Duplicate value for {column}
it: Valore di {column} è duplicato

source: Wrong value
it: Valore errato

source: '{value}' does not match
it: '{value}' non combacia

source: {value} not allowed
it: {value} non è permesso

source: field is invalid
it: il campo non è valido

source: Must be a single line of no more than 255 chars
it: Deve essere una singola riga con non più di 255 caratteri

source: Must be a negative number
it: Deve essere un numero negativo

source: Zip is not valid
it: CAP non valido

source: Email is not valid
it: Email non è valida

source: Must be between 4 and 255 chars
it: Deve essere tra 4 e 255 caratteri

source: Must not be all digits
it: Non possono essere tutti numeri

source: Not a valid IP address
it: Indirizzo IP non valido

source: Must be a positive integer
it: Deve essere un numero intero positivo

source: Must not be empty
it: La linea non può essere vuota

source: Not a valid state
it: Non è uno stato valido

source: Must be between 8 and 255 chars, and contain a non-alpha char
it: Deve essere tra 8 e 255 caratteri, contenente anche caratteri non alfabetici

source: Must not contain spaces
it: Non deve contenere spazi

source: Must be a negative integer
it: Deve essere un numero intero negativo

source: Must be a single digit
it: Deve essere un numero ad una cifra sola

source: Field must contain a single word
it: Il campo deve contenere una sola parola

source: Field contains non-printable characters
it: Il campo contiene caratteri non stampabili

source: Must be a non-empty single line of no more than 255 chars
it: Deve essere una linea non vuota con non più di 255 caratteri

source: Must be made up of letters, digits, and underscores
it: Deve contenere lettere, numeri e trattini bassi

source: Must be a positive number
it: Deve essere un numero intero positivo

source: Date is too late
it: La data è già trascorsa

source: Date is too early
it: La data è troppo in anticipo

source: Not a valid DateTime
it: Non è un valore di data e ora valido

source: Email should be of the format [_1]
it: L'email deve essere nel formato [_1]

source: May have only one digit after the decimal point, but has {num_digits:num}
it: Può esserci solo una cifra dopo il punto decimale, invece ne ha {num_digits:num}

source: Must be a number. May contain numbers, +, - and decimal separator '[_1]'
it: Deve essere un numero. Può contenre numeri, +, - e separatore decimale '[_1]'

source: Total size of number must be less than or equal to {size}, but is {actual_size}
it: Il numero delle cifre deve essere minore o uguale a {size}, invece è {actual_size}

source: Value must be an integer
it: Il numero deve essere intero

source: Value cannot be converted to money
it: Il numero non può essere trasformato in valuta

source: Value must be a real number
it: Deve essere un numero reale

source: Value must be a positive integer
it: Deve essere un intero positivo

source: '[_1]' is not a valid value
it: '[_1]' non è un valore valido

source: This field does not take multiple values
it: Questo campo non ammette valori multipli

source: Field must contain a single value
it: Il campo deve contenere un valore singolo

source: Field must be at least {minlength} characters. You entered {length}
it: Il campo deve avere almeno {minlength} caratteri. Tu ne hai inseriti {length}

source: Field should not exceed {maxlength} characters. You entered {length}
it: Il campo non può eccedere i {maxlength} caratteri. Tu ne hai inseriti {length}

source: File is too big (> [_1] bytes)
it: Il file è troppo grande (> [_1] byte)

source: File is too small (< [_1] bytes)
it: Il file è troppo piccolo (< [_1] bytes)

source: File not found for upload field
it: Il file non è presente per il caricamento

source: File uploaded is empty
it: Il file caricato è vuoto
